Repository: KaiWy/admin-docs
Catalog: docs/source/locale/*/LC_MESSAGES/backup.po
Languages: de

source: In order to take a backup, it is sufficient to backup the content of MongoDB. All uploaded files are stored in the database and, therefore, covered by a database backup. MongoDB comes with built-in solutions for backups. Effektif recommends to use mongodump. For more detailed information about backups of MongoDB see the official documentation:
de: Um ein Backup zu erstellen, genügt es den Speicherinhalt von MongoDB zu sichern. Alle hochgeladenen Dateien sind in der Datenbank gespeichert und so durch ein Datenbankbackup gedeckt. MongoDB verfügt über programmeigene Backup-Features. Wir empfehlen mongodump zu verwenden. Weitere Informationen bezüglich Backups in MongoDB finden Sie hier:

source: Make sure the MongoDB server is running when you want to execute mongodump. If not stated otherwise via command line parameters, mongodump will try to backup data from the locally running mongod service.
de: Stellen Sie sicher, dass MongoDB ausgeführt wird wenn Sie mongodump ausführen. Falls nicht anders (über Kommandozeilenparameter) spezifiziert, versucht mongodump die Daten des lokal ausgeführten mongod Services zu sichern.

source: You will need to use the Effektif MongoDB user credentials again to access the data of the Effektif database. If you are using another MongoDB user to perform the backups, make sure he has the necessary roles. For the backups, the user needs to access all databases and the user data. The user should have the following roles:
de: Um auf die Daten in der Effektif-Datenbank zuzugreifen, benötigen Sie die Nutzerdaten des entsprechenden Datenbanknutzers. Falls Sie nicht den „Effektif“-Datenbanknutzer zum ausführen des Backups verwenden, stellen Sie sicher, dass der ausführende Nutzer die notwendigen Rechte innehat. Der Nutzer muss die folgenden Rollen innehaben:

source: You can specify the output folder where the content of the backup is stored. Be aware, if the directory contains already an older backup, the new backup will overwrite existing files. Alternatively, you could store several backups with a timestamp.
de: Sie können den Output-Ordner des Backups festlegen. Seien Sie sich bewusst, dass ältere Backups überschrieben werden, wenn Sie einen Ordner auswählen, der bereits ein Backup enthält. Um dies zu verhindern können Sie jedes Backup mit einem Zeitstempel versehen.

source: You should make sure the backup is stored in a safe location and cannot get lost if the server fails. Keep in mind, the backups can consume a lot of space, therefore, you should add additional disk space to the server if you plan storing on multiple versions of the backup.
de: Stellen Sie sicher, dass das Backup an einem sicheren Ort gespeichert wird und nicht verloren gehen kann, falls der Server ausfällt. Berücksichtigen Sie auch, dass Backups zusätzlichen Speicherplatz beanspruchen, der besonders bei der Erstellung von mehreren Backups schwer ins Gewicht fällt.

source: The following lines will show an example on how to do a backup with mongodump on different operating systems.
de: Die folgenden Beispiele illustrieren, wie ein Backup mit mongodump ausgeführt werden kann.

source: The ``mongodump.exe`` can be found in the MongoDB installation directory, ``$MONGO_HOME\bin\mongodump.exe``\ . You just have to create a directory where the backups should be stored and make sure the user doing the backups has the necessary read / write permissions. If you followed the instructions within this guide to setup MongoDB, the command to execute mongodump would look like this: ::
de: Die Datei ``mongodump.exe`` kann im MongoDB Installationsverzeichnis, also unter ``$MONGO_HOME\bin\mongodump.exe`` gefunden werden. Erstellen Sie ein Zielverzeichnis für die Backups und stellen Sie sicher, dass der Backup-ausführende Nutzer Lese- und Schreibzugriff auf dieses Verzeichnis hat. Falls Sie den Installationsanweisungen in diesem Handbuch genau gefolgt sind, ist der Befehl zum erstellen des Backups wie folgt: ::

source: In the example above, adjust the location of your MongoDB installation accordingly. The parameter -u defines the username and -p the password of the Effektif MongoDB user, replace them with your chosen values. The parameter -o specifies the output directory.
de: Der Ort der MongoDB-Installation in dem aufgeführten Beispiel muss gegebenenfalls angepasst werden. Der Parameter –u beschreibt den Nutzernamen, der Parameter –p das Passwort. Über –o wird das Zielverzeichnis festgelegt.

source: If you followed the instructions within this guide to setup MongoDB, then ``mongodump`` could be executed like this: ::
de: Im folgenden Beispiel gehen wir wieder davon aus, dass Sie den Installationsanweisungen in diesem Handbuch gefolgt sind. Der ``mongodump`` Befehl kann dann wie folgt ausgeführt werden: ::

source: Another example will create a folder with a timestamp for every new dump: ::
de: Das nächste Beispiel erstellt das Backup mit Zeitstempel: ::

source: The folder dumps would then contain a subfolder for every backup with a name similar to “2014-10-07-17-49-07”. However, this method doesn’t remove old backups.
de: Der Ordner dumps würde also Unterordner mit den Zeitstempel als Namen enthalten (zum Beispiel: “2014-10-07-17-49-07”) und jeder Unterordner würde ein Backup enthalten. Ältere Backups würden bestehen bleiben.

source: It's good practice to take backups regularly. We recommend using cron to schedule backups. You could for instance setup ``/etc/crontab`` that executes the mongodump command.
de: Wir empfehlen, Backups regelmäßig durchzuführen, zum Beispiel unter Verwendung von cron. Unter ``/etc/crontab`` können Sie einen cronjob erstellen, der den entsprechenden mongodump Befehl regelmäßig ausführt.

source: The parameter -u defines the username and -p the password of the Effektif MongoDB user, replace them with your chosen values. The parameter -o specifies the output directory, in this case /path/to/dumps. Make sure the executing user has the required privileges to write to the output folder.
de: Der Parameter –u beschreibt den Nutzernamen, der Parameter –p das Passwort. Über –o wird das Zielverzeichnis festgelegt, in diesem Fall /path/to/dumps. Stellen Sie sicher, dass der Backup-ausführende Nutzer Lese- und Schreibzugriff auf dieses Verzeichnis hat
