Repository: KaiWy/admin-docs
Catalog: docs/source/locale/*/LC_MESSAGES/update.po
Languages: de

source: Update
de: Aktualisieren

source: This section will guide you through an update of your Effektif system. It assumes you have successfully installed an early version of Effektif. If you are installing Effektif for the first time, you can skip this chapter.
de: Dieses Kapitel wird Sie schrittweise durch eine Aktualisierung Ihres Effektif-Systems führen. Hierbei wird angenommen, dass Sie bereits eine ältere Version von Effektif erfolgreich installiert haben. Wenn Sie Effektif zum ersten Mal installieren, können Sie dieses Kapitel überspringen.

source: Unpack Effektif
de: Effektif entpacken

source: Unzip the effektif-{version}.zip to a directory of your choice, e.g. ``/yourlocation/effektif-{version}`` In the rest of this guide, we'll refer to the effektif home directory as ``$EFFEKTIF_HOME``\ . The directory will contain the following files:
de: Entpacken Sie das Archiv effektif-{version}.zip in einem Verzeichnis Ihrer Wahl, zum Beispiel: ``/yourlocation/effektif-{version}`` Dieses Verzeichnis wird im weiteren Text als ``$EFFEKTIF_HOME`` bezeichnet. Das Verzeichnis enthält die folgenden Dateien:

source: \*.sh - Linux shell scripts
de: \*.sh - Linux Shellskripte

source: db - directory that contains MongoDB configuration files
de: db – Verzeichnis, das die MongoDB Konfigurationsdateien enthält

source: mongodb.conf - configuration file for Linux
de: mongodb.conf – Konfigurationsdateien für Linux

source: mongod.cfg - configuration file for Windows
de: mongod.cfg - Konfigurationsdateien für Windows

source: effektif - directory
de: effektif - Verzeichnis

source: ROOT - this directory contains the web application
de: ROOT - Verzeichnis, das die Webanwendung enthält

source: Stop Effektif
de: Effektif stoppen

source: Before you can start with the update process you have to shutdown the Effektif system. It is sufficient when you shutdown the Tomcat server Effektif is running on. You don't have to shutdown the MongoDB server. Refer to chapter :ref:`stopping` for information on how to stop Effektif.
de: Bevor Sie mit der Aktualisierung des Effektif-Systems starten können, müssen Sie zunächst das Effektif-System herunterfahren. Es reicht aus, wenn Sie hierfür den Tomcat Server beenden, in welchem Effektif ausgeführt wird. Den MongoDB Server müssen Sie für die Aktualisierung nicht beenden. In Kapitel :ref:`stopping` finden Sie weitere Information darüber, wie Sie Effektif stoppen.

source: Updating Effektif to a newer version might involve changes in the database schema. Therefore, you are requested to backup the database before you go on. See chapter :ref:`backup` for more information on how to create a backup.
de: Während der Aktualisierung von Effektif auf eine neuere Version kann es vorkommen, dass das Datenbankschema angepasst werden muss. Dementsprechend sollten Sie ein Backup der Datenbank anlegen, bevor Sie mit der Aktualisierung fortfahren. In Kapitel :ref:`backup` finden Sie mehr Informationen, wie Sie ein Backup mit MongoDB anlegen.

source: Backup the configuration files
de: Sichern der Konfigurationsdateien

source: During the first setup you have modified some configuration files and added the Effektif license file. In order to preserve those changes, you have to copy those files to another location before updating the Effektif system. You can find those files in the directory ``$TOMCAT_HOME/webapps/ROOT/WEB-INF/classes``\ .
de: Während der initialen Installation haben Sie einige Konfigurationsdateien bearbeitet und die Effektif Lizenzdatei installiert. Um diese Änderungen nicht zu verlieren, müssen die entsprechenden Konfigurationsdateien sichern und dafür an eine andere Stelle kopieren bevor Sie das Effektif-System aktualisieren. Sie finden die entsprechenden Dateien in dem Verzeichnis ``$TOMCAT_HOME/webapps/ROOT/WEB-INF/classes``\ .

source: Effektif configuration file
de: Effektif Konfigurationsdatei

source: configuration file for Effektif logs
de: Konfiguration der Effektif Logs

source: Effektif license file
de: Effektif Lizenzdatei

source: Simply copy the files mentioned above to another location, e.g. ``$TOMCAT_HOME/webapps``\ .
de: Kopieren Sie einfach die oben genannten Dateien in ein anderes Verzeichnis, z. B. ``$TOMCAT_HOME/webapps``\ .

source: Install a new version
de: Eine neue Version installieren

source: Delete the folder ``$TOMCAT_HOME/webapps/ROOT`` completely.
de: Löschen Sie den Ordner ``$TOMCAT_HOME/webapps/ROOT`` vollständig.

source: Copy the folder ``$EFFEKTIF_HOME/effektif/ROOT`` to ``$TOMCAT_HOME/webapps``\ .
de: Kopieren Sie den Ordner ``$EFFEKTIF_HOME/effektif/ROOT`` nach ``$TOMCAT_HOME/webapps``\ .

source: Copy the configuration files you have backed up in subsection :ref:`update-backup-configuration` back into the directory ``$TOMCAT_HOME/webapps/ROOT/WEB-INF/classes``\ .
de: Kopieren Sie die Konfigurationsdateien, die Sie in Abschnitt :ref:`update-backup-configuration` gesichert haben, zurück in das Verzeichnis ``$TOMCAT_HOME/webapps/ROOT/WEB-INF/classes``\ .

source: If you have been provided with a new ``license.xml``\ , copy the file into ``$TOMCAT_HOME/webapps/ROOT/WEB-INF/classes`` and replace the existing file. Otherwise, you can keep on using the old ``license.xml``\ .
de: Insofern Sie mit der Aktualisierung eine neue ``license.xml`` erhalten haben, kopieren Sie diese Datei in das Verzeichnis ``$TOMCAT_HOME/webapps/ROOT/WEB-INF/classes`` und ersetzen die bestehende Datei. Sollten Sie keine neue ``license.xml`` erhalten haben, können Sie weiterhin die alte Datei verwenden.

source: Revisit the configuration files
de: Konfigurationsdateien anpassen

source: Upon upgrading to a newer version, it might be necessary to update existing configuration files and add, remove, or modify some values. Therefore, it necessary that you refer to section :ref:`configure-effektif` and make sure your Effektif configuration file is up-to-date before starting the system again.
de: Wenn das System auf eine neuere Version gebracht wird, kann es notwendig sein, die existierenden Konfigurationsdateien erneut anzupassen und entsprechend Werte hinzuzufügen, anzupassen oder zu entfernen. Konsultieren Sie hierfür erneut Abschnitt :ref:`configure-effektif` und stellen Sie sicher, dass Ihre Effektif Konfiguration auf dem neuesten Stand ist bevor Sie das System wieder hochfahren.

source: Start Effektif
de: Effektif starten

source: When you have successfully installed the new Effektif version and verified that the configuration files are up-to-date, you can restart the Effektif system. Refer to chapter :ref:`starting-effektif` for more information on how to start Effektif.
de: Sobald Sie die neue Version von Effektif erfolgreich installiert und sichergestellt haben, dass die Konfiguration auf dem neuesten Stand ist, können Sie das Effektif-System wieder starten. Kapitel :ref:`starting-effektif` gibt Ihnen weitere Information, wie Sie Effektif starten.

source: Restore an older version
de: Eine ältere Version wieder herstellen

source: In case of exceptional problems you might want to restore an older version of Effektif. Be aware, if you revert Effektif to an older version, it is not guaranteed that you can keep on using your current database. The upgrade to a newer version can involve schema changes that render the database incompatible with older versions of Effektif. In this situation, the Effektif system will not start if it detects a newer version of the database schema which it doesn't support. This is the reason why you should create a backup before updating the system.
de: Im Falle eines außergewöhnlichen Fehlers kann es notwendig sein, das System wieder auf eine ältere Version von Effektif zurückzusetzen. Seien Sie sich bitte bewusst, dass es keine Garantie gibt, dass Sie eine ältere Version von Effektif mit der aktuellen Datenbank betreiben können. Die Aktualisierung von Effektif auf eine neuere Version kann Änderungen im Datenbankschema nach sich ziehen, die wiederum die Datenbank inkompatibel zu älteren Versionen von Effektif machen. In diesen Situation wird das Effektif-System nicht starten, wenn es eine neuere Datenbankversion als die vom System unterstützte Version erkennt. Aus diesem Grund sollten Sie vor jeder Aktualisierung ein Backup der Datenbank anlegen.

source: In order to restore an older version, you can follow the instructions in this chapter again. However, instead of creating a backup you should restore an older backup.
de: Um eine ältere Version wieder herzustellen, können Sie wiederum den Anweisungen in diesem Kapitel folgen. Jedoch statt ein Backup anzulegen, müssen Sie nun ein zuvor erstelltes Backup wieder herstellen.

source: Unpack the older version of Effektif, see :ref:`update-unpack-effektif`
de: Entpacken Sie die ältere Version von Effektif, vgl. :ref:`update-unpack-effektif`

source: Stop the Effektif system, see :ref:`update-stop-effektif`
de: Stoppen Sie das Effektif-System, vgl. :ref:`update-stop-effektif`

source: Restore an earlier back up that was taken while the old Effektif version was deployed. See chapter :ref:`restore` for more information on how to restore a backup.
de: Stellen Sie nun ein Backup der Datenbank wieder her, welches erstellt wurde, während die alte Effektif Version installiert war. Im Kapitel :ref:`restore` finden Sie weitere Hinweise, wie Sie ein Backup wieder herstellen können.

source: Backup the configuration files, see :ref:`update-backup-configuration`
de: Sichern Sie die Konfigurationsdateien, vgl. :ref:`update-backup-configuration`

source: Install the older version in ``$TOMCAT_HOME/webapps``\ , see :ref:`update-install-version`
de: Installieren Sie die ältere Version von Effektif in ``$TOMCAT_HOME/webapps``\ , vgl. :ref:`update-install-version`

source: Check the configuration files again, see :ref:`update-revisit-configuration`
de: Überprüfen Sie die Konfigurationsdateien erneut, vgl. :ref:`update-revisit-configuration`

source: Start the Effektif system, see :ref:`starting-effektif`
de: Starten Sie das Effektif-System, vgl. :ref:`starting-effektif`

source: Now, the Effektif system should be running with the older version again.
de: Jetzt sollte das Effektif-System wieder mit der alten Version laufen.

source: In order to update the Effektif system, you have to replace the ``ROOT`` folder in ``$TOMCAT_HOME/webapps`` with the newer version you can find in the extracted directory ``$EFFEKTIF_HOME/effektif``\ .
de: Um das Effektif-System zu aktualisieren, müssen Sie den Ordner ``ROOT`` im Verzeichnis ``$TOMCAT_HOME/webapps`` durch die neuere Version ersetzen, welche sich in dem entpackten Verzeichnis ``$EFFEKTIF_HOME/effektif`` befindet.
