Repository: KaiWy/admin-docs
Catalog: docs/_locale/*/LC_MESSAGES/tooling.po
Languages: de

source: This section lists some tools that might help you to administer and maintain your Effektif installation. Use them at your own discretion.
de: Dieses Kapitel listet einige Werkzeuge auf, die Ihnen dabei helfen können Ihre Effektif-Installation zu verwalten und zu warten. Nutzen Sie die entsprechenden Werkzeuge auf Ihre eigene Verantwortung.

source: Robomongo is a good tool for managing your MongoDB installation. It is free and available for different operating systems. Use it at your own discretion. Please, be careful when you use a tool to manipulate the database. Effektif does not guarantee that any manipulated data can be restored. The tool can be downloaded from:
de: Robomongo ist ein gutes Tool zur Verwaltung Ihrer MongoDB Installation. Es ist kostenfrei und für die gängigen Betriebssysteme verfügbar. Gehen Sie jedoch vorsichtig bei der Nutzung vor – beim eigenständigen Manipulieren der Datenbank kann es bei fahrlässiger Vorgehensweise natürlich vorkommen, dass Daten beschädigt werden, ohne dass das Effektif System eine Wiederherstellung garantieren kann. Das Tool kann unter dem folgenden Link heruntergeladen werden:

source: Connecting to MongoDB using Robomongo
de: Mit Robomongo eine Verbindung zu MongoDB herstellen

source: This section shows how to connect to your MongoDB server using Robomongo. Note that MongoDB 3.2 requires you to use the latest version of Robomongo.
de: Dieser Abschnitt wird Ihnen zeigen, wie man eine Verbindung mit MongoDB unter der Verwendung von Robomongo herstellen kann. Beachten Sie, MongoDB 3.2 benötigt die neueste Version von Robomongo.

source: *Important: If you try to connect to your MongoDB from a remote system, ensure the MongoDB configuration has either no value defined for ``bindIp`` or lists the IP address you are trying to connect to.*
de: *Wichtig: Wenn Sie versuchen von einem anderen System aus auf MongoDB zuzugreifen, stellen Sie bitte sicher, dass die MongoDB Konfiguration den Eintrag ``bindIp`` entweder nicht enthält oder die IP-Adresse auflistet zu der Sie sich verbinden möchten.*

source: Make sure your MongoDB server is running and open Robomongo.
de: Stellen Sie sicher, dass der MongoDB-Server läuft und öffnen Sie Robomongo.

source: In the upper-left corner, click the icon to open a new connection.
de: Klicken sie auf das Symbol in der oberen linken Ecke um eine neue Verbindung zu öffnen.

source: Click, the *Create* link to set-up a new connection.
de: Klicken Sie auf den Link *Create* um eine neue Verbindung zu erstellen.

source: In the dialog that opens up you can rename the connection. Change the address if you are connecting to a remote server, otherwise leave ``localhost`` there.
de: In dem Dialog, der sich nun öffnet, können Sie die Verbindung umbenennen. Ändern Sie die Adresse, wenn Sie sich zu einem entfernten Server verbinden wollen, ansonsten behalten Sie den Wert ``localhost`` bei.

source: If you enabled authorization for your MongoDB server, select the *Authentication* tab and activate the *Perform authentication* option. Then enter the *User Name* (``effektif``) and the *Password* you have chosen before.
de: Wenn Sie Authentifizierung für Ihren MongoDB-Server aktiviert haben, wählen Sie bitte das *Authentication* Tab aus und aktivieren Sie die Option *Perform authentication*\ . Geben Sie dann den Nutzernamen (``effektif``) unter *User Name* und das Passwort unter *Password* ein, welches Sie zuvor ausgewählt haben.

source: If you click *Test*\ , you should see a similar success message. Then click *Save*\ .
de: Wenn Sie auf *Test* klicken, sollten Sie eine ähnliche Erfolgsnachricht sehen. Klicken Sie anschließend auf *Save*\ .

source: Select the new item in the list and click *Connect*\ .
de: Wählen Sie den neuen Eintrag in der List aus und klicken Sie auf *Connect*\ .

source: You will see the connection in the left-hand panel and the two Effektif databases below it.
de: Sie sehen die hergestellte Verbindung in der linken Anzeige und darunter die zwei Effektif Datenbanken.
